Repository: JudleTeam/KAI_Telegram_Bot
Catalog: tgbot/locales/*/LC_MESSAGES/kai_bot.po
Languages: ru, tt

source: Back
ru: Назад
tt: Артка

source: Skip
ru: Пропустить
tt: Алга

source: Next
ru: Дальше
tt: Алга

source: Cancel
ru: Отмена
tt: Отмена

source: 🌍 Choose language
ru: 🌍 Выбор языка
tt: 🌍 Тел сайлау

source: Settings
ru: Настройки
tt: Караклар

source: 👥 Choose group
ru: 👥 Выбор группы
tt: 👥 Төркем сайлау

source: Verification
ru: Верификация
tt: Верификация

source: Via phone
ru: С помощью телефона
tt: Телефон ярдәмендә верификация

source: Check phone
ru: Проверить телефон
tt: Телефон номеры тикшерү

source: Login to KAI
ru: Вход в БРС
tt: БРСкага керү

source: Logout from KAI
ru: Выйти из БРС
tt: БРСкадан чыгу

source: Unlink account
ru: Отвязать аккаунт
tt: Отвязать аккаунт

source: Remove from favorites
ru: Убрать из избранного
tt: Убрать из избранного

source: Add to favorites
ru: Добавить в избранное
tt: Добавить в избранное

source: Channel
ru: Канал
tt: Канал

source: Enable emoji
ru: Включить эмодзи
tt: Эмодзи кабызырга

source: Disable emoji
ru: Выключить эмодзи
tt: Эмодзыны сүндерергә

source: Enable teachers
ru: Включить преподавателей
tt: Укытучыларны кабызырга

source: Disable teachers
ru: Выключить преподавателей
tt: Укытучыларны сүндерергә

source: Disable homework notifications
ru: Отключить уведомления о ДЗ
tt: Өй эше турында хәбәрнамәне өзәргә

source: Enable homework notifications
ru: Включить уведомления о ДЗ
tt: Өй эше турында хәбәрнамәне кертергә

source: Today
ru: Сегодня
tt: Бүген

source: Tomorrow
ru: Завтра
tt: Иртәгә

source: Day after tomorrow
ru: Послезавтра
tt: Берсекөнгә

source: Week schedule
ru: На неделю
tt: Бу атнага

source: Full
ru: Полное
tt: Тулы

source: Teachers
ru: Преподаватели
tt: Укытучылар

source: Exams
ru: Экзамены
tt: Имтиханнар

source: 2️⃣ Even
ru: 2️⃣ Чётная
tt: 2️⃣ Чётная

source: 1️⃣ Odd
ru: 1️⃣ Нечётная
tt: 1️⃣ Нечётная

source: Any week
ru: Чётная / нечётная
tt: Теләсә нинди атна

source: Details
ru: Подробнее
tt: Тулырак

source: Schedule
ru: Расписание
tt: Расписание бүлеге

source: Group №{group_name}
ru: Группа №{group_name}
tt: Төркем №{group_name}

source: My group
ru: Моя группа
tt: Минем төркем

source: Classmates
ru: Одногруппники
tt: Төркемдәшләр

source: Edit pinned text
ru: Изменить закреплённое сообщение
tt: Беркетелгән хәбәрне үзгәртергә

source: Homework
ru: Домашняя работа
tt: Өй эше

source: Edit
ru: Изменить
tt: Үзгәртергә

source: Delete
ru: Удалить
tt: Җибәрергә

source: Add
ru: Добавить
tt: Өстәп әйтү

source: Clear
ru: Очистить
tt: Чистартырга

source: Documents
ru: Документы
tt: Документлар

source: Syllabus
ru: Учебный план
tt: Уку планы

source: Educational program
ru: Образовательная программа
tt: Мәгариф программасы

source: Study schedule
ru: Учебный график
tt: Уку графигы

source: Contact us
ru: Связаться с нами
tt: Безгә хат язарга

source: Support project
ru: Поддержать проект
tt: Проектны хупларга

source: Guide
ru: Инструкция
tt: Күрсәтмәләр

source: Monday
ru: Понедельник
tt: Дүшәмбе

source: Tuesday
ru: Вторник
tt: Сишәмбе

source: Wednesday
ru: Среда
tt: Чәршәмбе

source: Thursday
ru: Четверг
tt: Пәнҗешәмбе

source: Friday
ru: Пятница
tt: Җомга

source: Saturday
ru: Суббота
tt: Шимбә

source: Sunday
ru: Воскресенье
tt: Якшәмбе

source: Welcome to KAI bot! Tap button below to choose your language
ru: Добро пожаловать в бота КАИ! Нажмите кнопку ниже для выбора языка
tt: КАИ ботка рәхим итегез! Тел сайлау өчен, астан кнопканы басыгыз

source: Main menu
ru: Главное меню
tt: Төп меню

source: Language changed
ru: Язык изменён
tt: Тел үзгәртелгән

source: You have been blocked for spam
ru: Вы были заблокированы за спам
tt: Без сезнең профильне бан бүлекгә күчердек (Спам)

source: Unlocked, you can continue to use the bot
ru: Вы были разблокированы, можете продолжить использовать бота
tt: Без сезнең профильне бан бүлектән азат иттердек

source: It looks like you aren't registered in the bot. Type "/start" to fix it
ru: Похоже вы не зарегистрированы в боте. Напишите "/start" чтобы исправить это
tt: Сезнең регистрация үтелмәгән. Эш башларга өчен "/start" команданы языгыз

source: You are blocked in the bot! If this is an error, contact the administrator
ru: Вы заблокированы в боте! Если это ошибка, свяжитесь с администратором
tt: Сез ботка керә алмыйсыз! Әгәр сез моны хата дип саныйсыз икән, администраторга хат языгыз

source: The language you are using is no longer available. Your language is set to "{language}" it can be changed in the settings
ru: Язык, который вы использовали, больше недоступен. Ваш язык изменён на "{language}", он может быть изменён в настройках
tt: Сез кулланган тел күбрәк мөмкин түгел. Сезнең телегез "{language}" га үзгәртелгән, ул настройкаларда үзгәртелергә мөмкин

source: Please select your language
ru: Пожалуйста, выберите ваш язык
tt: Зинһар, телегезне сайлагыз

source: Schedule menu Now {week} week 📖 - Homework
ru: Меню расписания Cейчас {week} неделя 📖 - Домашняя работа
tt: Расписание менюсы Хәзер {week} атна 📖 - Өй эше

source: 🧪 - Laboratory work 📝 - Seminar 📢 - Lecture ❓ - Consultation
ru: 🧪 - Лабораторная работа 📝 - Практика 📢 - Лекция ❓ - Консультация
tt: 🧪 - Лаборатория эше 📝 - Практика 📢 - Лекция ❓ - Консультация

source: Profile menu Selected group: {s_group_name} Your roles: {roles}
ru: Меню профиля Выбранная группа: {s_group_name} Ваши роли: {roles}
tt: Профиль менюсы Сайланган төркеме: {s_group_name} Сезнең роль: {roles}

source: Teacher's schedule "{name}" Department: "{departament} {parity} week {schedule} {parity} week
ru: Расписание преподавателя "{name}" Кафедра: "{departament} {parity} неделя {schedule} {parity} неделя
tt: Укытучының язуы "{name}" Кафедра: "{departament}" {parity} атна {schedule} {parity} атна

source: This is an information button - it doesn't do anything
ru: Это информационная кнопка - она ничего не делает
tt: Бу мәгълүмати төймә - ул берни дә эшләми

source: This document is not available on the website...
ru: Этого документа нет на сайте...
tt: Бу документ сайтта юк...

source: 📖 Homework: {homework}
ru: 📖 Домашняя работа: {homework}

source: No homework
ru: Нет домашней работы
tt: Өй эше юк

source: New homework has appeared for {date} in the discipline "{discipline}": {homework}
ru: Новая домашняя работа на {date} по дисциплине "{discipline}": {homework}
tt: "{discipline}" дисциплинасы буенча {date} елга яңа йорт эше: {homework}

source: Date: {date} Discipline: {discipline} Parity: {parity} Start time: {start_time} Current homework: {homework}
ru: Дата: {date} Дисциплина: {discipline} Чётность: {parity} Время: {start_time} Текущая домашняя работа: {homework}
tt: Дата: {date} Тәртип: {discipline} Чётность: {parity} Вакыт: {start_time} Хәзерге өй эше: {homework}

source: Welcome to KAI Bot! The language selected for you is "{language}" based on your Telegram settings It can be changed after registration in the settings, which are available in the profile section
ru: Добро пожаловать в КАИ бота! Для вас выбран язык "{language}", основываясь на ваших настройках Telegram Его можно будет изменить в разделе "Профиль" после регистрации
tt: КАИда ботага рәхим итегез! Сезнең өчен тел сайланган "{language}", сезнең Telegram төзелешенә нигезләнеп Аны "Профиль" бүлегендә теркәлгәннән соң үзгәртергә мөмкин булачак

source: ❕ This step can be skipped, just click "Next" button
ru: ❕ Этот шаг можно пропустить, просто нажми кнопку "Дальше"
tt: Бу адымны "Алга" төймәсенә басып кына уздырырга мөмкин

source: Group "{group_name}" has been automatically selected for you. The group can be changed in the profile and from the schedule
ru: Для вас автоматически была выбрана группа "{group_name}" Группу можно поменять в профиле и из расписания
tt: Сезнең өчен автомат рәвештә группа сайлап алынды"{group_name}" Төркемне профильдә һәм расписаниедән үзгәртергә мөмкин

source: Enter homework text
ru: Отправьте текст для домашней работы
tt: Өй эше өчен текст җибәрегез

source: Current homework: {homework} Enter new homework text
ru: Текущая домашняя работа: {homework} Отправьте текст новой домашней работы
tt: Хәзерге өй эше: {homework} Яңа өй эше текстын җибәрегез

source: To see details you need to be verified!
ru: Для доступа нужно верифицировать аккаунт!
tt: Керү өчен аккаунтны верификацияләргә кирәк!

source: You can see details only for your group!
ru: Смотреть подробности можно только у своей группы!
tt: Бөтен нечкәлекләрне үз төркемеңдә генә карарга мөмкин!

source: Day off
ru: Выходной
tt: Ял көне

source: Current group: {group_name} Enter a group number or select from your favorites
ru: Текущая группа: {group_name} Введите номер группы или выберите группу из избранных
tt: Агымдагы төркем: {group_name} Төркемнең номерын языгыз яки сайланганнардан төркемне сайлагыз

source: Group removed from favorites!
ru: Группа удалена из избранных!
tt: Төркем сайланганнардан чыгарылган!

source: Group added to favorites!
ru: Группа добавлена в избранные!
tt: Төркем сайланганнарга өстәлгән!

source: Current group changed!
ru: Текущая группа изменена!
tt: Агымдагы төркем үзгәртелде!

source: This group is already selected!
ru: Эта группа уже выбрана!
tt: Бу төркем сайлап алынган инде!

source: ❌ No such group exists!
ru: ❌ Такой группы нет!
tt: ❌ Андый төркем юк!

source: Functionality in development
ru: Функционал в разработке
tt: Бу функция разработкада

source: List of teachers {group_name}: ———————————————— {teachers}
ru: Список преподавателей {group_name}: ———————————————— {teachers}
tt: Укучылар исемлеге {group_name}: ———————————————— {teachers}

source: Your faculty is not currently supported... If you want your faculty to have full functionality, write to us through the "Help" section Pinned text: {pinned_text}
ru: Ваш факультет сейчас не поддерживается... Если хотите чтобы у вашего был полный функционал, напишите нам через раздел "Помощь" Закреплённый текст: {pinned_text}
tt: Сезнең факультет хәзер хупланмый... Әгәр сезнең тулы функционал булуын телисез икән, "Ярдәм" бүлеге аша языгыз. Куелган текст: {pinned_text}

source: An error occurred on the KAI side. Please, try later
ru: Возникла ошибка на стороне КАИ. Пожалуйста, попробуйте позже
tt: КАИ ягыннан хата булган. Соңрак сынап карагыз зинhар

source: Something went wrong
ru: Что-то пошло не так
tt: Ниндидер хата булды

source: You need to select a group
ru: Сначала нужно выбрать группу
tt: Башта группаны сайларга кирәк

source: Invalid {command} command format. After the command, there should be a user's Telegram ID. Example: "{command} 393867797"
ru: Неверный формат команды {command}. После команды должен быть Telegram ID пользователя. Пример: "{command} 393867797"
tt: {command} команданың кире форматы. Командадан соң кулланучы Telegram ID булырга тиеш. Үрнәк: "{command} 393867797"

source: User {user_id} does not exist
ru: Пользователь {user_id} не существует
tt: {user_id} юк

source: User {user_id} has been blocked
ru: Пользователь {user_id} был заблокирован
tt: {user_id} блокланган

source: User {user_id} has been unblocked
ru: Пользователь {user_id} был разблокирован
tt: {user_id} блокировкадан чыгарылган

source: You have been blocked by the administrator!
ru: Вы были заблокированы администратором!
tt: Сез администрация тарафыннан блокланган!

source: You have been unblocked by the administrator!
ru: Вы были разблокированы администратором!
tt: Сез администрация тарафыннан блокировкадан чыгардылар!

source: Verification Phone verified: {phone_status} KAI credentials: {kai_status} Profile verified: {profile_status}
ru: Верификация Телефон подтверждён: {phone_status} Данные для БРС: {kai_status} Профиль подтверждён: {profile_status}
tt: Верификация Телефон расланды: {phone_status} БРС мәгълүматлар: {kai_status} Профиль расланды: {profile_status}

source: Verification Please, input your login
ru: Верификация Пожалуйста, введите ваш логин
tt: Верификация Зинhар, үзегезнең логиныгызны языгыз

source: Verification Please, input your password
ru: Верификация Пожалуйста, введите ваш пароль
tt: Верификация Зинһар, паролегезне языгыз

source: Authorization... Please wait a moment
ru: Авторизация... Пожалуйста, подождите немного
tt: Авторизация... Зинhар, бераз сабыр итегез

source: ‼️ Something went wrong! Looks like you entered the wrong credentials
ru: ‼️ Что-то пошло не так! Похоже вы ввели неверные логин или пароль
tt: ‼️ Хата булды! Сез дөрес логин яки пароль кертмәдегез

source: ✅ Hooray! You have successfully verified your account
ru: ✅ Ура! Вы успешно подтвердили свой аккаунт
tt: ✅ Ура! Сез үз профиль уңышлы расладыгыз

source: Your credentials have been removed from the database
ru: Ваши логин и пароль были удалены из базы данных
tt: Сезнең логин hәм пароль базлардан чистартылган

source: Please, share your contact
ru: Пожалуйста, поделитесь вашим контактом
tt: Сезнең контактлар белән бүлешегез зинhар

source: ✅ Your phone number has been verified!
ru: ✅ Ваш номер телефона был подтверждён!
tt: ✅ Сезнең телефон номеры расланды!

source: ☑️ Your phone number was found in the database and your profile is now verified
ru: ☑️ Ваш номер телефона был найден в базе и ваш профиль теперь верифицирован
tt: ☑️ Сезнең телефон номеры базада табылды һәм сезнең профиль тикшерелде

source: ❌ Your phone number was not found in the database
ru: ❌ Ваш номер телефона не найден в базе
tt: ❌ Сезнең телефон номеры базада табылмады

source: ❌ Someone is already signed in with these credentials
ru: ❌ Кто-то уже вошёл в этот аккаунт
tt: ❌ Кемдер бу профильгә керде инде

source: You have successfully unlinked your account
ru: Вы успешно отвязали свой аккаунт
tt: Сез үз аккаунтыгызны уңышлы бәйләдегез

source: Subscribe to the Telegram channel of the project! There will be the latest news on the project and more!
ru: Подписывайся на Telegram канал нашего проекта! В нём будут публиковаться последние новости проекта и не только!
tt: Безнең проектның Telegram каналына языл! Анда проектның соңгы хәбәрләре бастырылачак һәм ул гына да түгел!

source: ❌ Account with this number already linked to someone else Telegram
ru: ❌ Аккаунт с этим номеров телефона уже привязан к какому-то Telegram аккаунту
tt: ❌ Бу телефон номеры белән аккаунт ниндидер Telegram аккаунтына бәйләнгән инде

source: You don't have to do this!
ru: Не надо этого делать!
tt: Моны эшләргә кирәкми!

source: Sorry, I don't know how to work in group chats yet
ru: Извините, я пока не умею работать в групповых чатах
tt: Гафу итегез, мин әлегә төркемле чатларда эшли белмим

source: Education menu
ru: Меню обучения
tt: Укыту менюсы

source: My group ({group_name}) Year: {year} | Faculty: {faculty} Institute: {institute} Departament: {departament} Speciality: {speciality} Profile: {profile} Pinned text: {pinned_text}
ru: Моя группа ({group_name}) Курс: {year} | Факультет: {faculty} Институт: {institute} Кафедра: {departament} Специальность: {speciality} Профиль: {profile} Закреплённый текст: {pinned_text}
tt: Минем төркеме ({group_name}) Курс: {year} | Факультет: {faculty} Институт: {institute} Кафедра: {departament} Hөнәр: {speciality} Профиль: {profile} Ныгытылган текст: {pinned_text}

source: You need to be verified to access
ru: Для доступа нужно верифицировать аккаунт
tt: Керү өчен профильне тикшерергә кирәк (Верификация кирәк)

source: Missing
ru: Отсутствует
tt: Юк

source: My group ({group_name}) Classmates: {classmates}
ru: Моя группа ({group_name}) Одногруппники: {classmates}
tt: Минем төркеме ({group_name}) Төркемдәшләр: {classmates}

source: Invalid /set_prefix command format. The command should be followed by the user's Telegram ID, then a new prefix (can be empty, limit 32 symbols). Example: "/set_prefix 393867797 💩"
ru: Неверный формат команды /set_prefix. После команды должен идти Telegram ID пользователя, затем новый префикс (может быть пустым, лимит 32 символа). Пример: "/set_prefix 393867797 💩"
tt: /set_prefix команданың кире форматы. Командадан соң Telegram ID барырга тиеш,аннары яңа префикс (буш булырга мөмкин, 32 символ лимиты). Үрнәк: "/set_prefix 393867797 💩"

source: User {user_id} does not exist or is not verified
ru: Пользователь {user_id} не существует или не верифицирован
tt: {user_id} кулланучы юк яки верификацияләнмәгән

source: User {user_id} was prefixed with {prefix}
ru: Пользователю {user_id} был установлен префикс {prefix}
tt: {user_id}'ка {prefix} префикс урнаштырылды

source: Invalid /send_message command format. The command must be a reply to a message that you must send. The command should be followed by the user's Telegram ID, to whom the message will be sent
ru: Неверный формат команды /send_message. Команда должна быть ответом на сообщение. После команды должен идти Telegram ID пользователя, которому будет отправлено сообщение
tt: /send_message команданың кире форматы. Команда хәбәргә җавап булырга тиеш. Командадан соң Telegram ID кулланучы барырга тиеш, аңа хәбәр җибәреләчәк

source: The message was sent to user {user_id}
ru: Сообщение было отправлено пользователю {user_id}
tt: Хәбәр {user_id} җибәрелгән була

source: Full name: {full_name} Position in the group: {group_pos} Native group: {n_group_name} Phone: {phone} Email: {email}
ru: ФИО: {full_name} Номер в группе: {group_pos} Родная группа: {n_group_name} Телефон: {phone} Почта: {email}
tt: ФИО: {full_name} Төркем эчендә номер: {group_pos} Туган төркем: {n_group_name} Телефон: {phone} Почта: {email}

source: Birthday: {birthday} Number of the record book: {zach}
ru: День рождения: {birthday} Номер зачётки: {zach}
tt: Туган көн: {birthday} Зачет китабы номеры: {zach}

source: Telegram ID: {telegram_id} Telegram full name: {tg_full_name} Telegram mention: {tg_mention} Telegram phone: {telegram_phone} Is blocked: {is_blocked} Selected group: {s_group_name} Roles: {roles}
ru: Telegram ID: {telegram_id} Имя в Telegram: {tg_full_name} Обращение в Telegram: {tg_mention} Телефон в Telegram: {telegram_phone} Заблокирован ли: {is_blocked} Выбранная группа: {s_group_name} Роли: {roles}
tt: Telegram ID: {telegram_id} Telegram исеме: {tg_full_name} Telegram мөрәҗәгате: {tg_mention} Telegram телефоны: {telegram_phone} Блоклаштырылганмы: {is_blocked} Сайланган төркеме: {s_group_name} Рольләр: {roles}

source: Enter the text of the pinned message
ru: Введите текст для закреплённого сообщения
tt: Беркетелгән хәбәр өчен текст языгыз

source: Help menu
ru: Меню помощи
tt: Ярдәм менюсы

source: This is not your phone number! Submit your number using the button below
ru: Это не ваш номер телефона! Отправьте ваш номер с помощью кнопки внизу
tt: Бу сезнең телефон номеры түгел! Безгә сезнең номерны астан кнопка ярдәмендә җибәрегез

source: Even week
ru: Чётная неделя
tt: Чёт атнасы

source: Odd week
ru: Нечетная неделя
tt: Нечет атнасы

source: Settings Use emoji in schedule: {emoji_status} Show teachers in schedule: {teachers_status} Homework notifications: {homework_notify}
ru: Настройки Использовать эмодзи в расписании: {emoji_status} Показывать преподавателей в расписании: {teachers_status} Уведомления о новых домашних заданиях: {homework_notify}
tt: Караклар Эмодзын расписаниедә кулланырга: {emoji_status} Укытучыларны расписаниедә күрсәтергә: {teachers_status} Өй эше турында хәбәрләр: {homework_notify}

source: Education
ru: Учёба
tt: Уку бүлеге

source: Shop
ru: Магазин
tt: Магазин бүлеге

source: Profile
ru: Профиль
tt: Профиль бүлеге

source: Help
ru: Помощь
tt: Ярдәм бүлеге

source: Share contact
ru: Поделиться контактом
tt: Контакт белән бүлешү

source: Student
ru: Студент
tt: Студент

source: Group leader
ru: Староста
tt: Староста

source: Authorized
ru: Авторизован
tt: Авторизация үтелгән

source: Verified
ru: Верифицирован
tt: Верификация үтелгән

source: Admin
ru: Админ
tt: Админ

source: ❗️To log into BRS, your username and password are needed 🔒 Rest assured, your data is immediately encrypted and removed from chat For data deletion, contact support. Your safety is our priority 🤝
tt: БРСга керү өчен сезнең логин һәм пароль кирәк 🔒 Бу куркынычсыз - барысы да шундук шифрлана һәм чаттан читкә китә. Парольне алу өчен, ярдәмгә языгыз. Сезнең куркынычсызлык - безнең өстенлегебез 🤝
